hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_sdm_regs.h
/*
 * CH1ERR (RW)
 *
 * Ch1 Error interrupt enable
 */
#define SDM_INT_EN_CH1ERR_MASK (0x2U)
#define SDM_INT_EN_CH1ERR_SHIFT (1U)
#define SDM_INT_EN_CH1ERR_SET(x) (((uint32_t)(x) << SDM_INT_EN_CH1ERR_SHIFT) & SDM_INT_EN_CH1ERR_MASK)
#define SDM_INT_EN_CH1ERR_GET(x) (((uint32_t)(x) & SDM_INT_EN_CH1ERR_MASK) >> SDM_INT_EN_CH1ERR_SHIFT)

/*
 * CH0ERR (RW)
 *
 * Ch0 Error interrupt enable
 */
#define SDM_INT_EN_CH0ERR_MASK (0x1U)
#define SDM_INT_EN_CH0ERR_SHIFT (0U)
#define SDM_INT_EN_CH0ERR_SET(x) (((uint32_t)(x) << SDM_INT_EN_CH0ERR_SHIFT) & SDM_INT_EN_CH0ERR_MASK)
#define SDM_INT_EN_CH0ERR_GET(x) (((uint32_t)(x) & SDM_INT_EN_CH0ERR_MASK) >> SDM_INT_EN_CH0ERR_SHIFT)

/* Bitfield definition for register: STATUS */
/*
 * CH3DRY (RO)
 *
 * Ch3 Data Ready.
 * De-assert this bit by reading the data (or data fifo) registers.
 */
#define SDM_STATUS_CH3DRY_MASK (0x80U)
#define SDM_STATUS_CH3DRY_SHIFT (7U)
#define SDM_STATUS_CH3DRY_GET(x) (((uint32_t)(x) & SDM_STATUS_CH3DRY_MASK) >> SDM_STATUS_CH3DRY_SHIFT)

/*
 * CH2DRY (RO)
 *
 * Ch2 Data Ready
 */
#define SDM_STATUS_CH2DRY_MASK (0x40U)
#define SDM_STATUS_CH2DRY_SHIFT (6U)
#define SDM_STATUS_CH2DRY_GET(x) (((uint32_t)(x) & SDM_STATUS_CH2DRY_MASK) >> SDM_STATUS_CH2DRY_SHIFT)

/*
 * CH1DRY (RO)
 *
 * Ch1 Data Ready
 */
#define SDM_STATUS_CH1DRY_MASK (0x20U)
#define SDM_STATUS_CH1DRY_SHIFT (5U)
#define SDM_STATUS_CH1DRY_GET(x) (((uint32_t)(x) & SDM_STATUS_CH1DRY_MASK) >> SDM_STATUS_CH1DRY_SHIFT)

/*
 * CH0DRY (RO)
 *
 * Ch0 Data Ready
 */
#define SDM_STATUS_CH0DRY_MASK (0x10U)
#define SDM_STATUS_CH0DRY_SHIFT (4U)
#define SDM_STATUS_CH0DRY_GET(x) (((uint32_t)(x) & SDM_STATUS_CH0DRY_MASK) >> SDM_STATUS_CH0DRY_SHIFT)

/*
 * CH3ERR (RO)
 *
 * Ch3 Error.
 * ORed together by channel related error signals and corresponding error interrupt enable signals.
 * De-assert this bit by write-1-clear the corresponding error status bits in the channel status registers.
 */
#define SDM_STATUS_CH3ERR_MASK (0x8U)
#define SDM_STATUS_CH3ERR_SHIFT (3U)
#define SDM_STATUS_CH3ERR_GET(x) (((uint32_t)(x) & SDM_STATUS_CH3ERR_MASK) >> SDM_STATUS_CH3ERR_SHIFT)

/*
 * CH2ERR (RO)
 *
 * Ch2 Error
 */
#define SDM_STATUS_CH2ERR_MASK (0x4U)
#define SDM_STATUS_CH2ERR_SHIFT (2U)
#define SDM_STATUS_CH2ERR_GET(x) (((uint32_t)(x) & SDM_STATUS_CH2ERR_MASK) >> SDM_STATUS_CH2ERR_SHIFT)

/*
 * CH1ERR (RO)
 *
 * Ch1 Error
 */
#define SDM_STATUS_CH1ERR_MASK (0x2U)
#define SDM_STATUS_CH1ERR_SHIFT (1U)
#define SDM_STATUS_CH1ERR_GET(x) (((uint32_t)(x) & SDM_STATUS_CH1ERR_MASK) >> SDM_STATUS_CH1ERR_SHIFT)

/*
 * CH0ERR (RO)
 *
 * Ch0 Error
 */
#define SDM_STATUS_CH0ERR_MASK (0x1U)
#define SDM_STATUS_CH0ERR_SHIFT (0U)
#define SDM_STATUS_CH0ERR_GET(x) (((uint32_t)(x) & SDM_STATUS_CH0ERR_MASK) >> SDM_STATUS_CH0ERR_SHIFT)

/* Bitfield definition for register of struct array CH: SDFIFOCTRL */
/*
 * THRSH (RW)
 *
 * FIFO threshold (0,..,16) (fillings > threshold, then gen int)
 */
#define SDM_CH_SDFIFOCTRL_THRSH_MASK (0x1F0U)
#define SDM_CH_SDFIFOCTRL_THRSH_SHIFT (4U)
#define SDM_CH_SDFIFOCTRL_THRSH_SET(x) (((uint32_t)(x) << SDM_CH_SDFIFOCTRL_THRSH_SHIFT) & SDM_CH_SDFIFOCTRL_THRSH_MASK)
#define SDM_CH_SDFIFOCTRL_THRSH_GET(x) (((uint32_t)(x) & SDM_CH_SDFIFOCTRL_THRSH_MASK) >> SDM_CH_SDFIFOCTRL_THRSH_SHIFT)

/*
 * D_RDY_INT_EN (RW)
 *
 * FIFO data ready interrupt enable
 */
#define SDM_CH_SDFIFOCTRL_D_RDY_INT_EN_MASK (0x4U)
#define SDM_CH_SDFIFOCTRL_D_RDY_INT_EN_SHIFT (2U)
#define SDM_CH_SDFIFOCTRL_D_RDY_INT_EN_SET(x) (((uint32_t)(x) << SDM_CH_SDFIFOCTRL_D_RDY_INT_EN_SHIFT) & SDM_CH_SDFIFOCTRL_D_RDY_INT_EN_MASK)
#define SDM_CH_SDFIFOCTRL_D_RDY_INT_EN_GET(x) (((uint32_t)(x) & SDM_CH_SDFIFOCTRL_D_RDY_INT_EN_MASK) >> SDM_CH_SDFIFOCTRL_D_RDY_INT_EN_SHIFT)

/* Bitfield definition for register of struct array CH: SDCTRLP */
/*
 * MANCH_THR (RW)
 *
 * Manchester Decoding threshold. 3/4 of PERIOD_MCLK[7:0]
 */
#define SDM_CH_SDCTRLP_MANCH_THR_MASK (0xFE000000UL)
#define SDM_CH_SDCTRLP_MANCH_THR_SHIFT (25U)
#define SDM_CH_SDCTRLP_MANCH_THR_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_MANCH_THR_SHIFT) & SDM_CH_SDCTRLP_MANCH_THR_MASK)
#define SDM_CH_SDCTRLP_MANCH_THR_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_MANCH_THR_MASK) >> SDM_CH_SDCTRLP_MANCH_THR_SHIFT)

/*
 * WDOG_THR (RW)
 *
 * Watch dog threshold for channel failure of CLK halting
 */
#define SDM_CH_SDCTRLP_WDOG_THR_MASK (0x1FE0000UL)
#define SDM_CH_SDCTRLP_WDOG_THR_SHIFT (17U)
#define SDM_CH_SDCTRLP_WDOG_THR_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_WDOG_THR_SHIFT) & SDM_CH_SDCTRLP_WDOG_THR_MASK)
#define SDM_CH_SDCTRLP_WDOG_THR_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_WDOG_THR_MASK) >> SDM_CH_SDCTRLP_WDOG_THR_SHIFT)

/*
 * AF_IE (RW)
 *
 * Acknowledge feedback interrupt enable
 */
#define SDM_CH_SDCTRLP_AF_IE_MASK (0x10000UL)
#define SDM_CH_SDCTRLP_AF_IE_SHIFT (16U)
#define SDM_CH_SDCTRLP_AF_IE_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_AF_IE_SHIFT) & SDM_CH_SDCTRLP_AF_IE_MASK)
#define SDM_CH_SDCTRLP_AF_IE_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_AF_IE_MASK) >> SDM_CH_SDCTRLP_AF_IE_SHIFT)

/*
 * DFFOVIE (RW)
 *
 * Ch Data FIFO overflow interrupt enable
 */
#define SDM_CH_SDCTRLP_DFFOVIE_MASK (0x8000U)
#define SDM_CH_SDCTRLP_DFFOVIE_SHIFT (15U)
#define SDM_CH_SDCTRLP_DFFOVIE_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_DFFOVIE_SHIFT) & SDM_CH_SDCTRLP_DFFOVIE_MASK)
#define SDM_CH_SDCTRLP_DFFOVIE_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_DFFOVIE_MASK) >> SDM_CH_SDCTRLP_DFFOVIE_SHIFT)

/*
 * DSATIE (RW)
 *
 * Ch CIC Data Saturation Interrupt Enable
 */
#define SDM_CH_SDCTRLP_DSATIE_MASK (0x4000U)
#define SDM_CH_SDCTRLP_DSATIE_SHIFT (14U)
#define SDM_CH_SDCTRLP_DSATIE_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_DSATIE_SHIFT) & SDM_CH_SDCTRLP_DSATIE_MASK)
#define SDM_CH_SDCTRLP_DSATIE_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_DSATIE_MASK) >> SDM_CH_SDCTRLP_DSATIE_SHIFT)

/*
 * DRIE (RW)
 *
 * Ch Data Ready Interrupt Enable
 */
#define SDM_CH_SDCTRLP_DRIE_MASK (0x2000U)
#define SDM_CH_SDCTRLP_DRIE_SHIFT (13U)
#define SDM_CH_SDCTRLP_DRIE_SET(x) (((uint32_t)(x) << SDM_CH_SDCTRLP_DRIE_SHIFT) & SDM_CH_SDCTRLP_DRIE_MASK)
#define SDM_CH_SDCTRLP_DRIE_GET(x) (((uint32_t)(x) & SDM_CH_SDCTRLP_DRIE_MASK) >> SDM_CH_SDCTRLP_DRIE_SHIFT)

