hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_sdm_regs.h
/*
 * FIFO_DR (W1C)
 *
 * FIFO data ready
 */
#define SDM_CH_SDST_FIFO_DR_MASK (0x200U)
#define SDM_CH_SDST_FIFO_DR_SHIFT (9U)
#define SDM_CH_SDST_FIFO_DR_SET(x) (((uint32_t)(x) << SDM_CH_SDST_FIFO_DR_SHIFT) & SDM_CH_SDST_FIFO_DR_MASK)
#define SDM_CH_SDST_FIFO_DR_GET(x) (((uint32_t)(x) & SDM_CH_SDST_FIFO_DR_MASK) >> SDM_CH_SDST_FIFO_DR_SHIFT)

/*
 * AF (W1C)
 *
 * Achnowledge flag
 */
#define SDM_CH_SDST_AF_MASK (0x100U)
#define SDM_CH_SDST_AF_SHIFT (8U)
#define SDM_CH_SDST_AF_SET(x) (((uint32_t)(x) << SDM_CH_SDST_AF_SHIFT) & SDM_CH_SDST_AF_MASK)
#define SDM_CH_SDST_AF_GET(x) (((uint32_t)(x) & SDM_CH_SDST_AF_MASK) >> SDM_CH_SDST_AF_SHIFT)

/*
 * DOV_ERR (W1C)
 *
 * Data FIFO Overflow Error. Error flag.
 */
#define SDM_CH_SDST_DOV_ERR_MASK (0x80U)
#define SDM_CH_SDST_DOV_ERR_SHIFT (7U)
#define SDM_CH_SDST_DOV_ERR_SET(x) (((uint32_t)(x) << SDM_CH_SDST_DOV_ERR_SHIFT) & SDM_CH_SDST_DOV_ERR_MASK)
#define SDM_CH_SDST_DOV_ERR_GET(x) (((uint32_t)(x) & SDM_CH_SDST_DOV_ERR_MASK) >> SDM_CH_SDST_DOV_ERR_SHIFT)

/*
 * DSAT_ERR (W1C)
 *
 * CIC out Data saturation err. Error flag.
 */
#define SDM_CH_SDST_DSAT_ERR_MASK (0x40U)
#define SDM_CH_SDST_DSAT_ERR_SHIFT (6U)
#define SDM_CH_SDST_DSAT_ERR_SET(x) (((uint32_t)(x) << SDM_CH_SDST_DSAT_ERR_SHIFT) & SDM_CH_SDST_DSAT_ERR_MASK)
#define SDM_CH_SDST_DSAT_ERR_GET(x) (((uint32_t)(x) & SDM_CH_SDST_DSAT_ERR_MASK) >> SDM_CH_SDST_DSAT_ERR_SHIFT)

/*
 * WTSYNFLG (RO)
 *
 * Wait-for-sync event found
 */
#define SDM_CH_SDST_WTSYNFLG_MASK (0x20U)
#define SDM_CH_SDST_WTSYNFLG_SHIFT (5U)
#define SDM_CH_SDST_WTSYNFLG_GET(x) (((uint32_t)(x) & SDM_CH_SDST_WTSYNFLG_MASK) >> SDM_CH_SDST_WTSYNFLG_SHIFT)

/*
 * FILL (RO)
 *
 * Data FIFO Fillings
 */
#define SDM_CH_SDST_FILL_MASK (0x1FU)
#define SDM_CH_SDST_FILL_SHIFT (0U)
#define SDM_CH_SDST_FILL_GET(x) (((uint32_t)(x) & SDM_CH_SDST_FILL_MASK) >> SDM_CH_SDST_FILL_SHIFT)

/* Bitfield definition for register of struct array CH: SDATA */
/*
 * VAL (RO)
 *
 * Data
 */
#define SDM_CH_SDATA_VAL_MASK (0xFFFFFFFFUL)
#define SDM_CH_SDATA_VAL_SHIFT (0U)
#define SDM_CH_SDATA_VAL_GET(x) (((uint32_t)(x) & SDM_CH_SDATA_VAL_MASK) >> SDM_CH_SDATA_VAL_SHIFT)

/* Bitfield definition for register of struct array CH: SDFIFO */
/*
 * VAL (RO)
 *
 * FIFO Data
 */
#define SDM_CH_SDFIFO_VAL_MASK (0xFFFFFFFFUL)
#define SDM_CH_SDFIFO_VAL_SHIFT (0U)
#define SDM_CH_SDFIFO_VAL_GET(x) (((uint32_t)(x) & SDM_CH_SDFIFO_VAL_MASK) >> SDM_CH_SDFIFO_VAL_SHIFT)

/* Bitfield definition for register of struct array CH: SCAMP */
/*
 * VAL (RO)
 *
 * instant Amplitude Results
 */
#define SDM_CH_SCAMP_VAL_MASK (0xFFFFU)
#define SDM_CH_SCAMP_VAL_SHIFT (0U)
#define SDM_CH_SCAMP_VAL_GET(x) (((uint32_t)(x) & SDM_CH_SCAMP_VAL_MASK) >> SDM_CH_SCAMP_VAL_SHIFT)

/* Bitfield definition for register of struct array CH: SCHTL */
/*
 * VAL (RW)
 *
 * Amplitude Threshold for High Limit
 */
#define SDM_CH_SCHTL_VAL_MASK (0xFFFFU)
#define SDM_CH_SCHTL_VAL_SHIFT (0U)
#define SDM_CH_SCHTL_VAL_SET(x) (((uint32_t)(x) << SDM_CH_SCHTL_VAL_SHIFT) & SDM_CH_SCHTL_VAL_MASK)
#define SDM_CH_SCHTL_VAL_GET(x) (((uint32_t)(x) & SDM_CH_SCHTL_VAL_MASK) >> SDM_CH_SCHTL_VAL_SHIFT)

/* Bitfield definition for register of struct array CH: SCHTLZ */
/*
 * VAL (RW)
 *
 * Amplitude Threshold for zero crossing
 */
#define SDM_CH_SCHTLZ_VAL_MASK (0xFFFFU)
#define SDM_CH_SCHTLZ_VAL_SHIFT (0U)
#define SDM_CH_SCHTLZ_VAL_SET(x) (((uint32_t)(x) << SDM_CH_SCHTLZ_VAL_SHIFT) & SDM_CH_SCHTLZ_VAL_MASK)
#define SDM_CH_SCHTLZ_VAL_GET(x) (((uint32_t)(x) & SDM_CH_SCHTLZ_VAL_MASK) >> SDM_CH_SCHTLZ_VAL_SHIFT)

/* Bitfield definition for register of struct array CH: SCLLT */
/*
 * VAL (RW)
 *
 * Amplitude Threshold for low limit
 */
#define SDM_CH_SCLLT_VAL_MASK (0xFFFFU)
#define SDM_CH_SCLLT_VAL_SHIFT (0U)
#define SDM_CH_SCLLT_VAL_SET(x) (((uint32_t)(x) << SDM_CH_SCLLT_VAL_SHIFT) & SDM_CH_SCLLT_VAL_MASK)
#define SDM_CH_SCLLT_VAL_GET(x) (((uint32_t)(x) & SDM_CH_SCLLT_VAL_MASK) >> SDM_CH_SCLLT_VAL_SHIFT)

/* Bitfield definition for register of struct array CH: SCCTRL */
/*
 * HZ_EN (RW)
 *
 * Zero Crossing Enable
 */
#define SDM_CH_SCCTRL_HZ_EN_MASK (0x800000UL)
#define SDM_CH_SCCTRL_HZ_EN_SHIFT (23U)
#define SDM_CH_SCCTRL_HZ_EN_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_HZ_EN_SHIFT) & SDM_CH_SCCTRL_HZ_EN_MASK)
#define SDM_CH_SCCTRL_HZ_EN_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_HZ_EN_MASK) >> SDM_CH_SCCTRL_HZ_EN_SHIFT)

/*
 * MF_IE (RW)
 *
 * Module failure Interrupt enable
 */
#define SDM_CH_SCCTRL_MF_IE_MASK (0x400000UL)
#define SDM_CH_SCCTRL_MF_IE_SHIFT (22U)
#define SDM_CH_SCCTRL_MF_IE_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_MF_IE_SHIFT) & SDM_CH_SCCTRL_MF_IE_MASK)
#define SDM_CH_SCCTRL_MF_IE_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_MF_IE_MASK) >> SDM_CH_SCCTRL_MF_IE_SHIFT)

/*
 * HL_IE (RW)
 *
 * HLT Interrupt Enable
 */
#define SDM_CH_SCCTRL_HL_IE_MASK (0x200000UL)
#define SDM_CH_SCCTRL_HL_IE_SHIFT (21U)
#define SDM_CH_SCCTRL_HL_IE_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_HL_IE_SHIFT) & SDM_CH_SCCTRL_HL_IE_MASK)
#define SDM_CH_SCCTRL_HL_IE_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_HL_IE_MASK) >> SDM_CH_SCCTRL_HL_IE_SHIFT)

/*
 * LL_IE (RW)
 *
 * LLT interrupt Enable
 */
#define SDM_CH_SCCTRL_LL_IE_MASK (0x100000UL)
#define SDM_CH_SCCTRL_LL_IE_SHIFT (20U)
#define SDM_CH_SCCTRL_LL_IE_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_LL_IE_SHIFT) & SDM_CH_SCCTRL_LL_IE_MASK)
#define SDM_CH_SCCTRL_LL_IE_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_LL_IE_MASK) >> SDM_CH_SCCTRL_LL_IE_SHIFT)

/*
 * SGD_ORDR (RW)
 *
 * CIC order
 * 0: SYNC1
 * 1: SYNC2
 * 2: SYNC3
 * 3: FAST_SYNC
 */
#define SDM_CH_SCCTRL_SGD_ORDR_MASK (0xC0000UL)
#define SDM_CH_SCCTRL_SGD_ORDR_SHIFT (18U)
#define SDM_CH_SCCTRL_SGD_ORDR_SET(x) (((uint32_t)(x) << SDM_CH_SCCTRL_SGD_ORDR_SHIFT) & SDM_CH_SCCTRL_SGD_ORDR_MASK)
#define SDM_CH_SCCTRL_SGD_ORDR_GET(x) (((uint32_t)(x) & SDM_CH_SCCTRL_SGD_ORDR_MASK) >> SDM_CH_SCCTRL_SGD_ORDR_SHIFT)

